package 마무리정리;

public class 마무리정리 {

//		1. 기본형 형변환 중, 아래 코드를 수정해보세요.
//		   int x = 100;
//		   byte y = x;
//		2. 참조형 형변환이 되는 조건은?
//		3. 상속에서 위에 물려주는 클래스를 무엇이라고 부르는가?
//		4. 상속에서 아래 물려받는 클래스를 무엇이라고 부르는가?
//		5. 상속을 사용할 때 키워드는 다음중 무엇? 1) extend 2) extends 3) implements
//		6. 기본형 데이터 4가지
//		7. 참조형 데이터 2가지 이상
//		8. 참조형 형변환 중, 아래 코드를 수정해보세요.
//		   Car c = new Car();
//		   Truck t = new Truck(); //Truck은 Car를 상속받아 만들었음.
//		   t = c; //수정해보세요.
//		9. 기본형, 참조형 변수에 각각 들어있는 것은?
//		10. 참조형 변수를 초기화하려고 한다. 무엇으로 초기화해야할까?
//		11. null이란?
//		12. 포장클래스(랩퍼클래스)란? 종류 2가지
//		13. 업캐스팅이란?
//		14. 다운캐스팅이란?

	// 1. int x = 100; byte y = (byte) x;
	// 2. 상속관계
	// 3. 부모클래스 super클래스
	// 4. 자식클래스 sub클래스
	// 5. extends
	// 6. 문자, 실수, 정수, 논리
	// 7. 클래스, 배열 등등
	// 8. t = (Truck) c;
	// 9. 기본형 - 값, 참조형 - 주소
	// 10. null
	// 11. 데이터가 아무것도 들어있지 않은 상태
	// 12. Integer, Double, Boolean, Character 기본형을 클래스로 만들어 놓은 것.
	// 13. 하위클래스에서 상위클래스로 형변환하는 것
	// 14. 상위클래스에서 하위클래스로 형변환하는 것

}
